package model


class DataAboutLabs {

    // 7 class
    val labs7Name = arrayListOf<String>(
            "Изучение зависимости пути от времени при прямолинейном равномерном движении. Измерение скорости",
            "Исследование зависимости силы трения скольжения от силы нормального давления",
            "Выяснение условий равновесия рычага"
    )

    val labs7Theme = arrayListOf<String>(
            "Механика",
            "Механика",
            "Механика"
    )

    val labs7Equipment = arrayListOf<String>(
            "Металлический шарик, желоб, секундомер, линейка, цветной скотч.",
            "Динамометр, деревянный брусок, трибометр, набор грузов, полоска резины.",
            "Рычаг, закрепленный на штативе, набор грузов, динамометр, линейка."
    )

    val labs7Description = arrayListOf<String>(
            "Научиться измерять скорость тела при равномерном движении.",
            "Выяснить, зависит ли сила трения скольжения от силы нормального давления, если зависит, то как.",
            "Проверить на опыте, при каком соотношении сил и их плеч находится в равновесии. Проверить на опыте правило моментов."
    )

    //8 class
    val labs8Name = arrayListOf<String>(
            "Исследование изменения со временем температуры остывающей воды",
            "Сравнение количеств теплоты при смешивании воды разной температуры",
            "Измерение удельной теплоёмкости твёрдого тела",
            "Сборка электромагнита и испытание его в действии",
            "Изучение электрического двигателя постоянного тока на модели"
    )

    val labs8Theme = arrayListOf<String>(
            "Теплоемкость",
            "Теплоемкость",
            "теплоемкость",
            "Магнетизм",
            "Магнетизм + электродвигатель"
    )

    val labs8Equipment = arrayListOf<String>(
            "Cосуд с горячей водой, стакан, термометр, песочные часы (1 мин). ",
            "Калориметр, измерительный цилиндр (мензурка), термометр, стакан.",
            "Сосуд с горячей водой, стакан с водой комнатной температуры, металлический цилиндр на нити, весы, гири, термометр, калориметр.",
            "Источник питания, реостат, ключ, соединительные провода, компас, детали для сборки электромагнита: источника питания, катушки электромагнита, амперметра, реостата и ключа",
            "Модель электродвигателя, источник питания, ключ, соединительные провода. "
    )

    val labs8Description = arrayListOf<String>(
            "Модель электродвигателя, источник питания, ключ, соединительные провода. ",
            "определить количество теплоты, отданное горячей водой и полученное холодной при теплообмене, и объяснить полученный результат.",
            "Определить удельную теплоёмкость металлического цилиндра.",
            "Собрать электромагнит из готовых деталей и на опыте проверить, от чего зависит его магнитное действие",
            "Ознакомиться с основными деталями электрического двигателя постоянного тока на модели этого двигателя и изучить принцип его действия."
    )

    //9 class
    val labs9Name = arrayListOf<String>(
            "Исследование равноускоренного движения без начальной скорости",
            "Измерение ускорения свободного падения",
            "Исследование зависимости периода и частоты свободных колебаний математического маятника от его длины",
            "Изучение деления ядра атома урана по фотографиям треков",
            "Изучение треков заряженных частиц по готовым фотографиям",
            "Изучение движения тел по окружности под действием силы упругости и тяжести",
            "Опытная проверка закона Гей-Люссака",
            "Наблюдение действия магнитного поля на ток",
            "Изучение явления электромагнитной индукции",
            "Определение ускорения свободного падения при помощи нитяного маятника"
    )

    val labs9Theme = arrayListOf<String>(
            "Механика",
            "Механика",
            "Маятники",
            "Ядерная физика",
            "Ядерная физика",
            "Маятники",
            "Термодинамика",
            "Магнетизм",
            "Магнетизм",
            "Маятники"
    )

    val labs9Equipment = arrayListOf<String>(
            "Желоб лабораторный, штатив с муфтой, секундомер, металлический цилиндр.",
            "Штатиф с муфтой и лапкой",
            "Штатив с муфтой и лапкой, шарик с нитью, секундомер",
            "Фотография треков заряженных частиц, образовавшихся при делении ядра атома урана",
            "Фотография треков заряженных частиц, образовавшихся при делении ядра атома урана",
            "Штатив с муфтой и лапкой, лента измерительная, циркуль, динамометр лабораторный, весы с разновесами, шарик на нити, кусочек пробки с отверстием, лист бумаги, линейка.",
            "Cтеклянная трубка, запаянная с одного конца, цилиндрический сосуд, стакан, пластилин.",
            "Штатив с муфтой и лапкой, источник питания, проволочный моток, дугообразный магнит, ключ, соединительные провода.",
            "Источник тока, гальванометр, катушка, железный сердечник, U-образный магнит, магнитная стрелка, реостат, ключ, витки проволки или катушка, соединительные провода",
            "Часы с секундной стрелкой, измерите. ьная лента с погрешностью 0,5 см, шарик с отверстием, нить, штатив с муфтой и кольцом."
    )

    val labs9Description = arrayListOf<String>(
            "Установить качественную зависимость скорости тела от времени при его равноускоренном движении из состояния покоя, определить ускорение движения тела. ",
            "Измерить ускорение свободного падения с помощью прибора для изучения движения тел",
            "Выяснить, как зависит период и частота свободных колебаний математического маятника от его длины.",
            "Применить закон импульса для объяснения движения двух ядер, образовавшихся при делении ядра атома урана",
            "Применить закон импульса для объяснения движения двух ядер, образовавшихся при делении ядра атома урана",
            "Определение центростремительного ускорения шарика при его равномерном движении по окружности.",
            "Экспериментальным путем проверить верность закона Гей-Люссака Для газа данной массы отношение объема к температуре постоянно, если давление газа не меняется.",
            "Исследовать взаимодействие тока с постоянным магнитом.",
            "Изучить явление электромагнитной индукции.",
            "Определить ускорение свободного падения при помощи маятника, оценить возможность и точность измерения ускорения данным способом."
    )
}